app/controllers/client_controller.rb

  def new
    if request.request_method === 'POST'
      c = Client.new(authorize(params))
      c.save!
---
INSERT INTO "clients" ("first_name", "last_name", "address", "postal_code", "phone", "product", "product_state", "brand", "product_name", "panne", "unique_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    if request.request_method === 'PATCH'
      attrs = authorize(params)
      client = Client.find_by!(unique_id: params[:unique_id])
      client.assign_attributes(attrs)
      client.save!
---
SELECT  "clients".* FROM "clients" WHERE "clients"."unique_id" = ? LIMIT 1  [["unique_id", "EFrve9rwGOvHsbnDVn3pxg"]]
UPDATE "clients" SET "panne" = ?, "updated_at" = ? WHERE "clients"."id" = ?  [["panne", "L'iphone marche plus vu qu'il est tombé par terre. :)"], ["updated_at", "2015-12-29 17:23:10.267870"], ["id", 15]]

  def view
    @client = Client.find_by!(unique_id: params[:unique_id])
---
SELECT  "clients".* FROM "clients" WHERE "clients"."unique_id" = ? LIMIT 1  [["unique_id", "11"]]